rust = '''親愛的顧客:


我們的金屬蓋均有防鏽塗層，以避免生鏽。根據我們的觀察，可能是在使用過程中，若受到較大力的摩擦，可能會破壞表面塗層，產生刮痕，並因儲存環境較潮濕而出現鏽斑。我們在客訴回樣的鏽斑附近確實觀察到了一些刮擦痕跡。

我們建議消費者在開關蓋子時避免施加大力摩擦於蓋緣，並將產品保存在乾燥的地方，以避免潮濕環境對金屬蓋的影響。

基於我們調查的結果，我們確定這並非工廠製程中的瑕疵問題，而是可能由於使用過程中的外力摩擦和儲存環境的潮濕所導致。因此，在這種情況下，我們無法提供退貨、換貨或退款的賠償方式。

我們非常重視您的反饋和意見，並將在改進產品包裝和提供更清晰的使用指南方面進一步努力。如果您有任何其他問題或需要進一步的協助，請隨時與我們聯繫。

再次感謝您對我們公司的支持和理解。

謝謝您。'''

caking = '''親愛的顧客，

對於奶粉受潮結塊的情況，我們了解到大多數情況是由於消費者保存不當所導致的。為了提高您的保存品質，我們建議您在使用奶粉之前注意以下幾點：

儲存環境：請確保將奶粉存放在乾燥、陰涼的地方，遠離陽光直射和潮濕的環境。避免存放在廚房或浴室等潮濕的地方。

容器密封：使用奶粉後，請確保將罐蓋或袋口密封良好，以防止潮濕空氣進入並影響奶粉的質量。

避免直接接觸水分：請避免使用潮濕的湯匙或手指直接接觸奶粉，以免導致潮濕傳播和結塊現象。

雖然大多數情況下是由於消費者保存不當所導致，但我們也明白在某些情況下可能存在工廠製造問題的可能性。如您已排除以上可能性，但仍遇到奶粉結塊問題，請立即聯繫我們的客戶服務團隊，我們將竭誠為您提供支援和協助。我們非常重視您的滿意度和品質問題，並將持續努力提供優質的產品和服務。

謝謝您的理解和支持。
'''

piece = '''親愛的顧客，

關於藍色碎屑的問題，我們已收到多則客訴。目前已確認為封塑膠外蓋棘輪所導致的藍色塑膠條狀異物。對於這項疏失我們感到十分抱歉，我們十分重視您的滿意度，並希望能提供解決方案。

因此，我們樂意為您提供換貨的選擇，或者給予一瓶全新的奶粉作為替代。

如果您選擇給予一瓶全新的奶粉作為替代，我們將安排寄送一瓶新的奶粉到您提供的地址，並確保其品質和安全。

請您告知我們您的選擇，我們將立即處理您的要求並安排相應的措施。如果您對其他方面有任何要求或疑問，請隨時向我們提出，我們將竭誠為您服務。

再次感謝您對我們的支持和理解，我們期待為您解決這個問題並為您帶來愉快的購物體驗。

謝謝您。
'''

bug = '''尊敬的顧客您好:

我們的奶粉在出廠時皆有充填氮氣，罐內含氧量低應不會有活蟲生存在產品內。且廠內均有蟲害監控措施以避免蟲類異物，推測來自於原廠的可能性不高。
除此之外，對於蟲類的防範，我們有很嚴格的配套:
1.工廠端現有多個生物異物防範措施，作業人員與物品皆有分區，所有原料從到貨到生產間皆有加強關注。
2.工廠可打開對外之窗戶皆有紗網區隔，在生產去內的窗戶皆為密封。
3.紫外線捕蟲燈監控可飛行之昆蟲，和昆蟲誘餌於靠近生產區的入口監測非飛行昆蟲。這些規範同時是定期檢查。
4.在填充前，所以奶粉罐皆倒置並吹入空氣清除所有異物。 在填充過程中的輸送帶皆為半封閉式作業，生產和灌裝過程步驟皆是在完全封閉或是遮蔽下完成。所以生產過程中昆蟲異物混入的機率很低。

綜上所述，我們在產品品管方面，是十分嚴格的，所以可以十分確認，奶粉在出廠時是沒有問題的。

此外，報告中指出，該批次奶粉在線上檢查紀錄中未發現異物，且放行檢驗項目均符合產品規格標準。同批次留樣檢查也未發現異物的存在。

儘管如此，我們十分重視您的滿意度，並希望能提供解決方案。我們樂意為您提供換貨的選擇，或者給予一瓶全新的奶粉作為替代。

如果您選擇給予一瓶全新的奶粉作為替代，我們將安排寄送一瓶新的奶粉到您提供的地址，並確保其品質和安全。

請您告知我們您的選擇，我們將立即處理您的要求並安排相應的措施。如果您對其他方面有任何要求或疑問，請隨時向我們提出，我們將竭誠為您服務。

再次感謝您對我們的支持和理解，我們期待為您解決這個問題並為您帶來愉快的購物體驗。

謝謝您。

'''

hair = '''尊敬的顧客:

根據我們的調查結果，該批次產品在放行時的檢驗數據均符合規格標準，且工廠抽檢的留樣產品也未發現類似狀況。

以下是針對您遇到在奶粉中遇到類似毛髮的問題的回覆:

工廠同時有針對毛髮異物的加強管理，措施如PPE ( Personal Protective Equipment)的稽核，每月的異物(毛髮)的確認和加強人對合規的工廠穿著的教育。
PPE相關科普: (https://www.bsigroup.com/zh-TW/Our-services/product-certification/industry-sector-schemes/personal-protective-equipment-ppe/ )

因此，我們認為您所發現的毛髮並非工廠所產生的疏失，當然，也不排除是其他異物的可能性。至於是何種異物，或許需要您提供圖片，待我們專業人員判斷後再回覆您。

然而，我們深感對於您的不愉快經驗表示歉意。作為對於此次事件的補償，我們提出以下方案供您選擇：

換貨方案：我們將提供給您一瓶新的奶粉作為替代，以確保您可以享受到符合品質標準的產品。

客戶忠誠折扣：我們將提供給您一份特別的忠誠折扣，可在未來的購買中使用，以表達我們對您的感謝和歉意。

請您告知我們您選擇的方案，或者如果您有任何其他的建議或疑問，請隨時與我們的客戶服務團隊聯繫。我們將竭誠為您提供協助並解決您的問題。

再次感謝您對我們產品的支持和合作。我們期待能夠繼續為您提供優質的產品和服務。
'''

default = '''您好，看來您對於我們的產品有一些疑問。很抱歉，就您目前的描述，我們暫且無法判斷問題產生的原因為何，您可以嘗試將問題描述得更仔細一些，方便我們做出判斷。
當然，也可能是因為先前沒有遇到類似的客訴情況，此時請您耐心等候，稍後會有真人客服人員為您服務。'''

no_milk_powder = '''您好，看來您對於我們的產品有一些疑問。很抱歉，就您目前的描述，我們暫且無法判斷問題產生的原因為何，您可以嘗試將問題描述得更仔細一些，方便我們做出判斷。謝謝您！'''

